data/Parm_PH_29/alpha_10/alpha_10_6000_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00532808 -0.00005347 0.00000000 0.00000624 0.00000000 0.00344490)
(0.00603093 -0.00005316 0.00000000 0.00000730 0.00000000 0.00365134)
(0.00539768 -0.00006915 0.00000000 0.00000125 0.00000000 0.00289636)
(0.00122249 -0.00022844 0.00000000 0.00009498 0.00000000 0.00102201)
(0.00070213 -0.00008805 0.00000000 0.00001369 0.00000000 0.00044803)
(0.00030964 -0.00007993 0.00000000 0.00004510 0.00000000 0.00111596)
(0.00049909 -0.00009877 0.00000000 0.00001807 0.00000000 0.00056691)
(0.00048490 -0.00037783 0.00000000 0.00028984 0.00000000 0.00078655)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
