data/Parm_PH_29/alpha_10/alpha_10_6000_3036/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.0347517967595153 0 0)
(-0.0347415976437859 -0.000285277220999189 -1.81087676659652e-22)
(-0.0350204458418361 -0.00144363301534347 -0)
(-0.0363359683290727 -0.00309794472349157 -5.45283853193017e-21)
(-0.0391425485843876 -0.00477115575821877 -3.27862702325158e-24)
(-0.0415897581968447 -0.00572108118960037 4.58605221551988e-20)
(-0.0426539285070315 -0.00608369857215541 -2.56379690509961e-20)
(-0.0424690602350427 -0.00611687792568912 7.99859307301136e-20)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.0335752276144479 -1.12352884942209e-19 0)
(-0.0335752276144553 0 0)
(-0.0335752276144479 0 0)
(-0.0335752276144479 0 0)
(-0.0335752276144553 0 0)
(-0.0335752276144332 0 0)
(-0.0335752276144405 0 0)
(-0.0335752276144405 0 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
