data/Parm_PH_29/alpha_10/alpha_10_6000_3036/system/leastSquareProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      leastSquareProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sigma2      sigma2 [0 0 0 0 0 0 0]  1e-4;
sigmaG2     sigmaG2 [0 0 0 0 0 0 0] .1;
N           4;
lambda      0.1;
// ************************************************************************* //
